#Задание 1

num = "11011100"
print(f"Число в десятичной системе {int(num)} Число в двоичной системе {int(num, 2)}")



#Задание 2

num2 = int(input("Введите любое число: "))
print(bin(num2))


